controllers/CarController.php

    public function actionCreate()
    {
        $model = new Car();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
---
INSERT INTO `car` (`car_type_id`, `car_brand_id`, `car_register`, `description`, `startdatetime`, `car_model`, `number_engine`, `number_tank`, `start_mile`, `max_fuel`, `usage_mile`, `repair_price`, `driver_id`, `event_color`) VALUES (4, 1, 'กง 5174', 'ใช้ส่งต่อผู้ป่วย', '2010-02-15', 'Commuter', '32432423423', '435345345', '1231', '72', '12314', '32423', 4, '#3c78d8')

    protected function findModel($id)
    {
        if (($model = Car::findOne($id)) !== null) {
---
SELECT * FROM `car` WHERE `car_id`='5'