views/car/_form.php


    <?php $form = ActiveForm::begin(); ?>

    <?= $form->field($model, 'car_type_id')->dropDownList(
        \yii\helpers\ArrayHelper::map(\app\models\CarType::find()->all(),'car_type_id','car_type_name'),
        ['prompt'=>'เลือกประเภท']
    )
    ?>

    <?= $form->field($model, 'car_brand_id')->dropDownList(
        \yii\helpers\ArrayHelper::map(\app\models\CarBrand::find()->all(),'car_brand_id','brand_name'),
        ['prompt'=>'เลือกยี่ห้อ']
    )
---
SELECT * FROM `car_type`
SELECT * FROM `car_brand`


    <?= $form->field($model, 'repair_price')->textInput(['maxlength' => true]) ?>

    <?= $form->field($model, 'driver_id')->dropDownList(
        \yii\helpers\ArrayHelper::map(\app\models\Drivers::find()->all(),'driver_id','driver_name'),
        ['prompt'=>'เลือกผู้ดูแล']
    )
---
SELECT * FROM `drivers`